// Задача_№6 Написать программу вычисления значения функции y=sin(a)
double a,y;
 Console.WriteLine("Вычисление y=sin(a) в радианной мере.");
System.Console.Write("Введите значение для переменной (a):");
     a=Convert.ToInt32(Console.ReadLine());
     Console.Write("Sin введёного вами числа для переменной (a)=");
Console.Write(y=Math.Sin(a));